#include "ofApp.h"

//--------------------------------------------------------------
void ofApp::setup(){
	ofBackground(47, 47, 47); // ”wŒiF‚Ìİ’è
	ofEnableAlphaBlending(); // “§–¾“xiƒAƒ‹ƒtƒ@ƒ`ƒƒƒ“ƒlƒ‹j‚ğ—LŒø‚É‚·‚é
	ofSetCircleResolution(64); // ‰~Œ`‚Ì‰ğ‘œ“x‚ğİ’è
}

//--------------------------------------------------------------
void ofApp::update(){

}

//--------------------------------------------------------------
void ofApp::draw(){
	ofSetColor(31, 127, 255, 127); // •`‰æF‚Ìİ’èiƒAƒ‹ƒtƒ@•t‚«j
	ofCircle(1024/2, 768/2, 100); // ‰~‚ğ•`‚­
	ofCircle(1024/2, 768/2, 100+40); // ”¼Œa‚ğ40‘‰Á‚³‚¹‚Ä‰~‚ğ•`‚­
	ofCircle(1024/2, 768/2, 100+80); // ”¼Œa‚ğ80‘‰Á‚³‚¹‚Ä‰~‚ğ•`‚­
	ofCircle(1024/2, 768/2, 100+120); // ”¼Œa‚ğ120‘‰Á‚³‚¹‚Ä‰~‚ğ•`‚­
	ofCircle(1024/2, 768/2, 100+160); // ”¼Œa‚ğ160‘‰Á‚³‚¹‚Ä‰~‚ğ•`‚­
}

//--------------------------------------------------------------
void ofApp::keyPressed(int key){

}

//--------------------------------------------------------------
void ofApp::keyReleased(int key){

}

//--------------------------------------------------------------
void ofApp::mouseMoved(int x, int y ){

}

//--------------------------------------------------------------
void ofApp::mouseDragged(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mousePressed(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseReleased(int x, int y, int button){

}

//--------------------------------------------------------------
void ofApp::mouseEntered(int x, int y){

}

//--------------------------------------------------------------
void ofApp::mouseExited(int x, int y){

}

//--------------------------------------------------------------
void ofApp::windowResized(int w, int h){

}

//--------------------------------------------------------------
void ofApp::gotMessage(ofMessage msg){

}

//--------------------------------------------------------------
void ofApp::dragEvent(ofDragInfo dragInfo){ 

}
